<!DOCTYPE html>
<html>
	<head>
		<title>Realisme Scientifique et Algorithmie - Lancelot Owczarczak</title>
		<link rel="stylesheet" href="/blog/style.css" type="text/css">
	</head>
	<body>
		<header>
			<div class="header_content">
				<h1>Lancelot Owczarczak</h1>
				<h4>Chevalier du code, sans peur et sans Segfault</h4>
			</div>
		</header>
		<section>
			<article>
				<h1>Realisme Scientifique et Algorithmie</h1>
				<h2>Qu'est ce que l'algorithmie peut nous apprendre sur la nature de la r&eacute;alit&eacute; ?</h2>
				<div class="author">Par <i>Lancelot</i> le <i>22 mars 2019</i></div>
				<p>
				Il y a quelques jours sur Twitter Thibault de MrPhi et L&ecirc; de Science4all ont eu <a href="https://twitter.com/le_science4all/status/1102614320196796416">une discussion tr&egrave;s int&eacute;ressante</a> sur la notion de r&eacute;alisme scientifique. Thibault y d&eacute;fendait un r&eacute;alisme scientifique probabiliste alors que L&ecirc; y d&eacute;fendait un anti-r&eacute;alisme instrumentalisme en s'appuyant sur la position que prend la theorie bayesienne Solomonoffiste.
				</p>
				<h3>Le Realisme Scientifique</h3>
				<p>Le Realisme Scientifique est une position de philosophie des sciences qui soutient qu'il est rationnel de penser que la science permet de connaitre au moins approximativement la nature de la realit&eacute;. Elle s'oppose &agrave; l'anti-r&eacute;alisme (ou instrumentalisme) qui soutient au contraire que la science ne permet que de cr&eacute;er des mod&egrave;les pr&eacute;dictifs mais ne nous disent absolument rien sur la nature de la r&eacute;alit&eacute; qui restera a jamais inatteignable.</p>
				<h3>L'Argument de la Multitude des Algorithmes</h3>
				<p>Un argument instrumentaliste permet de dire qu'il est illusoire de penser qu'on puisse apprendre quoi que ce soit des mod&egrave;les car il peut exister une infinit&eacute; de mod&egrave;les qui donne le m&ecirc;me r&eacute;sultat.</p>
			</article>
			<nav>
				<h4>Articles R&eacute;cents:</h4>
				<ul>
					<li><a href="#1">Realisme Scientifique et Algorithmie</a></li>
					<li><a href="#2">Reversibilite et voyage dans le temps</a></li>
				</ul>
			</nav>
		</section>
	</body>
</html>
